app/Controllers/AdminAuth.php

    public function dashboard()
    {
        $projects = $this->projectModel->findAll();
        $comments = $this->commentModel->findAll();

        $projects_inprogress = $this->projectModel->where('inprogress', 'inprogress')->findAll();
        $projects_pending = $this->projectModel->where('pending', 'pending')->findAll();
        $projects_completed = $this->projectModel->where('isComplete', 1)->findAll();
---
SELECT *
FROM `projects`
SELECT *
FROM `comments`
SELECT *
FROM `projects`
WHERE `inprogress` = 'inprogress'
SELECT *
FROM `projects`
WHERE `pending` = 'pending'
SELECT *
FROM `projects`
WHERE `isComplete` = 1

    public function login()
    {
        $projects = $this->projectModel->findAll();
        $projects_inprogress = $this->projectModel->where('inprogress', 'inprogress')->findAll();
        $projects_pending = $this->projectModel->where('pending', 'pending')->findAll();
        $projects_completed = $this->projectModel->where('isComplete', 1)->findAll();
---
SELECT *
FROM `projects`
SELECT *
FROM `projects`
WHERE `inprogress` = 'inprogress'
SELECT *
FROM `projects`
WHERE `pending` = 'pending'
SELECT *
FROM `projects`
WHERE `isComplete` = 1