app/Controllers/Projects.php

    public function getProjects()
    {
        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Methods: POST, GET, OPTIONS, PUT, DELETE");
        header("Access-Control-Allow-Headers: Content-Type");
        header("Access-Control-Allow-Credentials: true");

        $projects = $this->projectModel->findAll();
        $projects_inprogress = $this->projectModel->where('inprogress', 'inprogress')->findAll();
        $projects_pending = $this->projectModel->where('pending', 'pending')->findAll();
        $projects_completed = $this->projectModel->where('isComplete', 1)->findAll();
---
SELECT *
FROM `projects`
SELECT *
FROM `projects`
WHERE `inprogress` = 'inprogress'
SELECT *
FROM `projects`
WHERE `pending` = 'pending'
SELECT *
FROM `projects`
WHERE `isComplete` = 1

    public function getPending()
    {
        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Methods: POST, GET, OPTIONS, PUT, DELETE");
        header("Access-Control-Allow-Headers: Content-Type");
        header("Access-Control-Allow-Credentials: true");

        $projects_pending = $this->projectModel->where('pending', 'pending')->findAll();
---
SELECT *
FROM `projects`
WHERE `pending` = 'pending'

    public function getInprogress()
    {
        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Methods: POST, GET, OPTIONS, PUT, DELETE");
        header("Access-Control-Allow-Headers: Content-Type");
        header("Access-Control-Allow-Credentials: true");

        $projects_inprogress = $this->projectModel->where('inprogress', 'inprogress')->findAll();
---
SELECT *
FROM `projects`
WHERE `inprogress` = 'inprogress'

    public function getProject($id = null)
    {

        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Methods: POST, GET, OPTIONS, PUT, DELETE");
        header("Access-Control-Allow-Headers: Content-Type");
        header("Access-Control-Allow-Credentials: true");

        $project = $this->projectModel->find($id);
---
SELECT *
FROM `projects`
WHERE `projects`.`project_id` = '6'